----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 207, 207]             896
         LeakyReLU-2         [-1, 32, 207, 207]               0
       BatchNorm2d-3         [-1, 32, 207, 207]              64
              Conv-4         [-1, 32, 207, 207]               0
            Conv2d-5         [-1, 64, 207, 207]           2,112
         LeakyReLU-6         [-1, 64, 207, 207]               0
       BatchNorm2d-7         [-1, 64, 207, 207]             128
              Conv-8         [-1, 64, 207, 207]               0
            Conv2d-9         [-1, 32, 207, 207]          18,464
        LeakyReLU-10         [-1, 32, 207, 207]               0
      BatchNorm2d-11         [-1, 32, 207, 207]              64
             Conv-12         [-1, 32, 207, 207]               0
           Conv2d-13         [-1, 64, 207, 207]           2,112
        LeakyReLU-14         [-1, 64, 207, 207]               0
      BatchNorm2d-15         [-1, 64, 207, 207]             128
             Conv-16         [-1, 64, 207, 207]               0
           Conv2d-17         [-1, 32, 207, 207]          18,464
        LeakyReLU-18         [-1, 32, 207, 207]               0
      BatchNorm2d-19         [-1, 32, 207, 207]              64
             Conv-20         [-1, 32, 207, 207]               0
    ResidualBlock-21         [-1, 32, 207, 207]               0
           Conv2d-22         [-1, 64, 103, 103]          18,496
        LeakyReLU-23         [-1, 64, 103, 103]               0
      BatchNorm2d-24         [-1, 64, 103, 103]             128
             Conv-25         [-1, 64, 103, 103]               0
           Conv2d-26        [-1, 128, 103, 103]           8,320
        LeakyReLU-27        [-1, 128, 103, 103]               0
      BatchNorm2d-28        [-1, 128, 103, 103]             256
             Conv-29        [-1, 128, 103, 103]               0
           Conv2d-30         [-1, 64, 103, 103]          73,792
        LeakyReLU-31         [-1, 64, 103, 103]               0
      BatchNorm2d-32         [-1, 64, 103, 103]             128
             Conv-33         [-1, 64, 103, 103]               0
           Conv2d-34        [-1, 128, 103, 103]           8,320
        LeakyReLU-35        [-1, 128, 103, 103]               0
      BatchNorm2d-36        [-1, 128, 103, 103]             256
             Conv-37        [-1, 128, 103, 103]               0
           Conv2d-38         [-1, 64, 103, 103]          73,792
        LeakyReLU-39         [-1, 64, 103, 103]               0
      BatchNorm2d-40         [-1, 64, 103, 103]             128
             Conv-41         [-1, 64, 103, 103]               0
           Conv2d-42        [-1, 128, 103, 103]           8,320
        LeakyReLU-43        [-1, 128, 103, 103]               0
      BatchNorm2d-44        [-1, 128, 103, 103]             256
             Conv-45        [-1, 128, 103, 103]               0
           Conv2d-46         [-1, 64, 103, 103]          73,792
        LeakyReLU-47         [-1, 64, 103, 103]               0
      BatchNorm2d-48         [-1, 64, 103, 103]             128
             Conv-49         [-1, 64, 103, 103]               0
           Conv2d-50        [-1, 128, 103, 103]           8,320
        LeakyReLU-51        [-1, 128, 103, 103]               0
      BatchNorm2d-52        [-1, 128, 103, 103]             256
             Conv-53        [-1, 128, 103, 103]               0
           Conv2d-54         [-1, 64, 103, 103]          73,792
        LeakyReLU-55         [-1, 64, 103, 103]               0
      BatchNorm2d-56         [-1, 64, 103, 103]             128
             Conv-57         [-1, 64, 103, 103]               0
    ResidualBlock-58         [-1, 64, 103, 103]               0
           Conv2d-59          [-1, 128, 51, 51]          73,856
        LeakyReLU-60          [-1, 128, 51, 51]               0
      BatchNorm2d-61          [-1, 128, 51, 51]             256
             Conv-62          [-1, 128, 51, 51]               0
           Conv2d-63          [-1, 256, 51, 51]          33,024
        LeakyReLU-64          [-1, 256, 51, 51]               0
      BatchNorm2d-65          [-1, 256, 51, 51]             512
             Conv-66          [-1, 256, 51, 51]               0
           Conv2d-67          [-1, 128, 51, 51]         295,040
        LeakyReLU-68          [-1, 128, 51, 51]               0
      BatchNorm2d-69          [-1, 128, 51, 51]             256
             Conv-70          [-1, 128, 51, 51]               0
           Conv2d-71          [-1, 256, 51, 51]          33,024
        LeakyReLU-72          [-1, 256, 51, 51]               0
      BatchNorm2d-73          [-1, 256, 51, 51]             512
             Conv-74          [-1, 256, 51, 51]               0
           Conv2d-75          [-1, 128, 51, 51]         295,040
        LeakyReLU-76          [-1, 128, 51, 51]               0
      BatchNorm2d-77          [-1, 128, 51, 51]             256
             Conv-78          [-1, 128, 51, 51]               0
           Conv2d-79          [-1, 256, 51, 51]          33,024
        LeakyReLU-80          [-1, 256, 51, 51]               0
      BatchNorm2d-81          [-1, 256, 51, 51]             512
             Conv-82          [-1, 256, 51, 51]               0
           Conv2d-83          [-1, 128, 51, 51]         295,040
        LeakyReLU-84          [-1, 128, 51, 51]               0
      BatchNorm2d-85          [-1, 128, 51, 51]             256
             Conv-86          [-1, 128, 51, 51]               0
           Conv2d-87          [-1, 256, 51, 51]          33,024
        LeakyReLU-88          [-1, 256, 51, 51]               0
      BatchNorm2d-89          [-1, 256, 51, 51]             512
             Conv-90          [-1, 256, 51, 51]               0
           Conv2d-91          [-1, 128, 51, 51]         295,040
        LeakyReLU-92          [-1, 128, 51, 51]               0
      BatchNorm2d-93          [-1, 128, 51, 51]             256
             Conv-94          [-1, 128, 51, 51]               0
           Conv2d-95          [-1, 256, 51, 51]          33,024
        LeakyReLU-96          [-1, 256, 51, 51]               0
      BatchNorm2d-97          [-1, 256, 51, 51]             512
             Conv-98          [-1, 256, 51, 51]               0
           Conv2d-99          [-1, 128, 51, 51]         295,040
       LeakyReLU-100          [-1, 128, 51, 51]               0
     BatchNorm2d-101          [-1, 128, 51, 51]             256
            Conv-102          [-1, 128, 51, 51]               0
          Conv2d-103          [-1, 256, 51, 51]          33,024
       LeakyReLU-104          [-1, 256, 51, 51]               0
     BatchNorm2d-105          [-1, 256, 51, 51]             512
            Conv-106          [-1, 256, 51, 51]               0
          Conv2d-107          [-1, 128, 51, 51]         295,040
       LeakyReLU-108          [-1, 128, 51, 51]               0
     BatchNorm2d-109          [-1, 128, 51, 51]             256
            Conv-110          [-1, 128, 51, 51]               0
          Conv2d-111          [-1, 256, 51, 51]          33,024
       LeakyReLU-112          [-1, 256, 51, 51]               0
     BatchNorm2d-113          [-1, 256, 51, 51]             512
            Conv-114          [-1, 256, 51, 51]               0
          Conv2d-115          [-1, 128, 51, 51]         295,040
       LeakyReLU-116          [-1, 128, 51, 51]               0
     BatchNorm2d-117          [-1, 128, 51, 51]             256
            Conv-118          [-1, 128, 51, 51]               0
          Conv2d-119          [-1, 256, 51, 51]          33,024
       LeakyReLU-120          [-1, 256, 51, 51]               0
     BatchNorm2d-121          [-1, 256, 51, 51]             512
            Conv-122          [-1, 256, 51, 51]               0
          Conv2d-123          [-1, 128, 51, 51]         295,040
       LeakyReLU-124          [-1, 128, 51, 51]               0
     BatchNorm2d-125          [-1, 128, 51, 51]             256
            Conv-126          [-1, 128, 51, 51]               0
   ResidualBlock-127          [-1, 128, 51, 51]               0
          Conv2d-128          [-1, 256, 49, 49]         295,168
       LeakyReLU-129          [-1, 256, 49, 49]               0
     BatchNorm2d-130          [-1, 256, 49, 49]             512
            Conv-131          [-1, 256, 49, 49]               0
          Conv2d-132          [-1, 512, 47, 47]       1,180,160
       LeakyReLU-133          [-1, 512, 47, 47]               0
     BatchNorm2d-134          [-1, 512, 47, 47]           1,024
            Conv-135          [-1, 512, 47, 47]               0
          Conv2d-136         [-1, 1024, 47, 47]         525,312
       LeakyReLU-137         [-1, 1024, 47, 47]               0
     BatchNorm2d-138         [-1, 1024, 47, 47]           2,048
            Conv-139         [-1, 1024, 47, 47]               0
          Conv2d-140            [-1, 9, 47, 47]           9,225
       LeakyReLU-141            [-1, 9, 47, 47]               0
            Conv-142            [-1, 9, 47, 47]               0
          Detect-143              [-1, 4418, 9]               0
          Conv2d-144          [-1, 256, 23, 23]       1,179,904
       LeakyReLU-145          [-1, 256, 23, 23]               0
     BatchNorm2d-146          [-1, 256, 23, 23]             512
            Conv-147          [-1, 256, 23, 23]               0
          Conv2d-148          [-1, 512, 23, 23]         131,584
       LeakyReLU-149          [-1, 512, 23, 23]               0
     BatchNorm2d-150          [-1, 512, 23, 23]           1,024
            Conv-151          [-1, 512, 23, 23]               0
          Conv2d-152            [-1, 9, 23, 23]           4,617
       LeakyReLU-153            [-1, 9, 23, 23]               0
            Conv-154            [-1, 9, 23, 23]               0
          Detect-155              [-1, 1058, 9]               0
          Conv2d-156          [-1, 128, 11, 11]         295,040
       LeakyReLU-157          [-1, 128, 11, 11]               0
     BatchNorm2d-158          [-1, 128, 11, 11]             256
            Conv-159          [-1, 128, 11, 11]               0
          Conv2d-160          [-1, 256, 11, 11]          33,024
       LeakyReLU-161          [-1, 256, 11, 11]               0
     BatchNorm2d-162          [-1, 256, 11, 11]             512
            Conv-163          [-1, 256, 11, 11]               0
          Conv2d-164            [-1, 9, 11, 11]           2,313
       LeakyReLU-165            [-1, 9, 11, 11]               0
            Conv-166            [-1, 9, 11, 11]               0
          Detect-167               [-1, 242, 9]               0
================================================================
Total params: 6,758,107
Trainable params: 6,758,107
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.98
Forward/backward pass size (MB): 971.57
Params size (MB): 25.78
Estimated Total Size (MB): 999.33
----------------------------------------------------------------

Process finished with exit code 0
